# Reading data
Read the train.csv file as a pandas dataframe.

In [24]:
import pandas as pd
titanic = pd.read_csv('data/train.csv')
titanic

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

# Indexing
1. Create a function that returns the name of a passenger given their PassengerId.
2. Create a function that returns the PassengerId of a passenger given their Name.
3. Print a message with the ID of passenger **Montvila, Rev. Juozas** with the following format: 'The ID pf passenger Montvila, Rev. Juozas is ##'
4. Print a message with the name of the passenger with ID **42** with the following format: 'The passenger with ID 42 is X'

5. Print all information about the oldest passenger.

In [33]:
# 1. Create a function that returns the name of a passenger given their PassengerId.

#titanic[titanic.PassengerId == 1].Name

#df: pd.DataFrame, el argumento df va a leer un dataFrame
#argument: dtype
# -> dtype de la variable que regresa. 

def id_to_name(df: pd.DataFrame, id: int) -> str:
    """Regresa el nombre del pasajero dado su id.

    Args:
        df (pd.DataFrame): El conjunto de datos
        id (int): ID del pasajero

    Returns:
        str: Nombre del pasajero
    """
    passenger = df[df.PassengerId == id].Name
    return passenger[id-1]
    

id_to_name(titanic, 2)

'Cumings, Mrs. John Bradley (Florence Briggs Thayer)'

In [30]:
#2. Create a function that returns the PassengerId of a passenger given their Name.

def name_to_id(df: pd.DataFrame, name: str) -> int:
    """Regresa el ID del pasajero dado su nombre.

    Args:
        df (pd.DataFrame): El conjunto de datos
        name (str): Nombre del pasajero

    Returns:
        int: ID del pasajero
    """
    passenger = df[df.Name == name].PassengerId
    return int(passenger.iloc[0])

name_to_id(titanic, "Cumings, Mrs. John Bradley (Florence Briggs Thayer)")

2

In [28]:
#3. Print a message with the ID of passenger **Montvila, Rev. Juozas** with the following format: 
# 'The ID pf passenger Montvila, Rev. Juozas is ##'

def message_name_to_id(df: pd.DataFrame, name: str) -> int:
    """Regresa un mensaje del ID del pasajero dado su nombre.

    Args:
        df (pd.DataFrame): El conjunto de datos
        name (str): Nombre del pasajero

    Returns:
        int: Mensaje con el ID del pasajero
    """
    passenger = df[df.Name == name].PassengerId
    return print(f"The ID of passenger {name} is: {int(passenger.iloc[0])}") 


message_name_to_id(titanic, "Montvila, Rev. Juozas")

The ID of passenger Montvila, Rev. Juozas is: 887

In [27]:
#4. Print a message with the name of the passenger 
# with ID **42** with the following format: 'The passenger with ID 42 is X'


def message_id_to_name(df: pd.DataFrame, id: int) -> str:
    """Regresa un mensaje con el nombre del pasajero dado su id.

    Args:
        df (pd.DataFrame): El conjunto de datos
        id (int): ID del pasajero

    Returns:
        str: Mensaje con el nombre del pasajero
    """
    passenger = df[df.PassengerId == id].Name
    return print(f"The passenger with ID {id} is {passenger[id-1]}")
    

message_id_to_name(titanic, 42)

The passenger with ID 42 is Turpin, Mrs. William John Robert (Dorothy Ann Wonnacott)

In [26]:
#5. Print all information about the oldest passenger.

#oldest_passenger = titanic[titanic.Age == titanic.Age.max()]
#print(oldest_passenger)


def print_all_info(df: pd.DataFrame) -> pd.DataFrame:
    """Regresa toda la informaciÃ³n del valor mÃ¡ximo.

    Args:
        df (pd.DataFrame): El conjunto de datos

    Returns:
        pd.DataFrame: Toda la informaciÃ³n del pasajero
    """
    passenger = df[df.Age == df.Age.max()]
    return print(passenger)
    

print_all_info(titanic)

     PassengerId  Survived  Pclass                                  Name  \
630          631         1       1  Barkworth, Mr. Algernon Henry Wilson

      Sex   Age  SibSp  Parch Ticket  Fare Cabin Embarked
630  male  80.0      0      0  27042  30.0   A23        S

In [15]:
x = [i for i in range(100)]
x[:10]

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

In [ ]:
#titanic = pd.read_csv('data/train.csv')
#titanic = titanic.set_index('PassengerId')
#titanic

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [ ]:
#titanic.iloc[[1,5,9]]

#Iloc cuenta por indices (desde 0) como en Python.
#Loc cuenta desde 1

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

In [ ]:
#titanic.loc[[1,5,9]]

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S

# Subseting
We are asked to share data for analysis by a third party. Since our dataset contains personal details, we only want to share with them the following information: ticket classes, fares and port of embarkation. We are asked to deliver a sample of the first 100 rows of this dataset.

6. Create and save the new dataset in **data/port_fares.csv**.

In [25]:
port_fares = titanic.loc[:99, ['Pclass', 'Fare', 'Embarked']]

port_fares = port_fares.rename(columns = {"Pclass": "Ticket_classes", "Fare":"Fares", "Embarked": "Port_embarkation"})

port_fares.to_csv('data/port_fares.csv', index = False)

print(port_fares)

    Ticket_classes    Fares Port_embarkation
0                3   7.2500                S
1                1  71.2833                C
2                3   7.9250                S
3                1  53.1000                S
4                3   8.0500                S
..             ...      ...              ...
95               3   8.0500                S
96               1  34.6542                C
97               1  63.3583                C
98               2  23.0000                S
99               2  26.0000                S

[100 rows x 3 columns]

# Counting
7. We want to know if there were any survivors over the age of 60, print all of their information.
8. How many people over 60 survived?
9. What percentage of people over 60 survived?

# Women and children first?
10. Find out if women and children were more likely to survive.

11. Write a function that returns the percentage of people that survived from a subset given as a boolean Pandas series.

# Summarizing

12. What is the median age of the passengers?
13. How many passengers embarked from each port?

14. Generate two hypotheses about how does the survival rate differ among groups of passengers. Write your code to explore both hypotheses.